{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float16",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-AGE",
    "2": "I-AGE",
    "3": "B-SEX",
    "4": "I-SEX",
    "5": "B-CONDITION",
    "6": "I-CONDITION",
    "7": "B-STAGE",
    "8": "I-STAGE",
    "9": "B-BIOMARKER",
    "10": "I-BIOMARKER",
    "11": "B-MEDICATION",
    "12": "I-MEDICATION",
    "13": "B-LAB_VALUE",
    "14": "I-LAB_VALUE",
    "15": "B-ECOG",
    "16": "I-ECOG",
    "17": "B-PRIOR_THERAPY",
    "18": "I-PRIOR_THERAPY",
    "19": "B-RESPONSE",
    "20": "I-RESPONSE",
    "21": "B-COMORBIDITY",
    "22": "I-COMORBIDITY",
    "23": "B-ALLERGY",
    "24": "I-ALLERGY",
    "25": "B-METASTATIC_SITE",
    "26": "I-METASTATIC_SITE",
    "27": "B-DRUG_INTERACTION",
    "28": "I-DRUG_INTERACTION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-AGE": 1,
    "B-ALLERGY": 23,
    "B-BIOMARKER": 9,
    "B-COMORBIDITY": 21,
    "B-CONDITION": 5,
    "B-DRUG_INTERACTION": 27,
    "B-ECOG": 15,
    "B-LAB_VALUE": 13,
    "B-MEDICATION": 11,
    "B-METASTATIC_SITE": 25,
    "B-PRIOR_THERAPY": 17,
    "B-RESPONSE": 19,
    "B-SEX": 3,
    "B-STAGE": 7,
    "I-AGE": 2,
    "I-ALLERGY": 24,
    "I-BIOMARKER": 10,
    "I-COMORBIDITY": 22,
    "I-CONDITION": 6,
    "I-DRUG_INTERACTION": 28,
    "I-ECOG": 16,
    "I-LAB_VALUE": 14,
    "I-MEDICATION": 12,
    "I-METASTATIC_SITE": 26,
    "I-PRIOR_THERAPY": 18,
    "I-RESPONSE": 20,
    "I-SEX": 4,
    "I-STAGE": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
